# Intro_Pandas

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame([['a','b','c'], [1,2,3]]) # Create a DataFrame
df

   0  1  2
0  a  b  c
1  1  2  3

In [4]:
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6]}) # Create a DataFrame from a Dictionary
df

   a  b
0  1  4
1  2  5
2  3  6

In [5]:
df = pd.DataFrame(np.random.randint(1,10,6).reshape(2,3), # Create a DataFrame with integers between 1 and 10. Dimensions (2,3)
                  columns=['col_1','col_2','col_3'], index=['line_1','line_2']) # Put column and row name
df

        col_1  col_2  col_3
line_1      9      7      2
line_2      2      9      7

**Select Data**

In [6]:
df['col_1'] # Select col_1

line_1    9
line_2    2
Name: col_1, dtype: int32

In [7]:
df['col_1']['line_1'] # Select col_1 and line_1

9

In [8]:
df.loc['line_1'] # Select a row

col_1    9
col_2    7
col_3    2
Name: line_1, dtype: int32

In [9]:
df.loc[['line_1'], ['col_1','col_3']] # Select a row and two columns

        col_1  col_3
line_1      9      2

In [10]:
df.iloc[1] # Select a row

col_1    2
col_2    9
col_3    7
Name: line_2, dtype: int32

**Obs: loc takes nominal position into account, while iloc takes nominal position into account**

**Add and Remove Rows and Columns**

In [11]:
df['col_4'] = [0,7] # Add a column
df

        col_1  col_2  col_3  col_4
line_1      9      7      2      0
line_2      2      9      7      7

In [12]:
df.loc['line_3'] = [2,0,0,1] # Add a row
df

        col_1  col_2  col_3  col_4
line_1      9      7      2      0
line_2      2      9      7      7
line_3      2      0      0      1

In [18]:
df.drop('col_2', axis=1, inplace=True) # Remove column 2 permanently. axis=0 represents a row, while axis=1 represents a column

In [19]:
df

        col_1  col_3  col_4
line_1      9      2      0
line_2      2      7      7
line_3      2      0      1

In [20]:
df.drop('line_3', axis=0, inplace=True)
df

        col_1  col_3  col_4
line_1      9      2      0
line_2      2      7      7

**Manipulate DataFrames**

In [23]:
df2 = pd.DataFrame({'a': [1,2,np.nan], 'b': [5,6,3], 'c': [2,4,np.nan]}) # Create DataFrame with NaN
df2

     a  b    c
0  1.0  5  2.0
1  2.0  6  4.0
2  NaN  3  NaN

In [22]:
df2.dropna() # Remove the row with NaN

     a  b    c
0  1.0  5  2.0
1  2.0  6  4.0

In [24]:
df2.fillna('Marcelo') # Subs all NaN to Marcelo

         a  b        c
0      1.0  5      2.0
1      2.0  6      4.0
2  Marcelo  3  Marcelo

In [25]:
df2.fillna(value=df2['b'].mean()) # Subs all NaN to mean of colunm b

          a  b         c
0  1.000000  5  2.000000
1  2.000000  6  4.000000
2  4.666667  3  4.666667

**Info of DataFrames**

In [29]:
df_cars = pd.DataFrame ({
    'modelo': ['Uno', 'Monza', 'Camaro', 'Gol', 'Palio'],
    'marca': ['Fiat', 'Chevrolet', 'Chevrolet', 'VW', 'Fiat'],
    'valor': [10000, 20000, 200000, 30000, 15000],
    'unidades': [10,30,100,25,15]
})
df_cars

   modelo      marca   valor  unidades
0     Uno       Fiat   10000        10
1   Monza  Chevrolet   20000        30
2  Camaro  Chevrolet  200000       100
3     Gol         VW   30000        25
4   Palio       Fiat   15000        15

In [30]:
df_cars.describe()

              valor    unidades
count       5.00000    5.000000
mean    55000.00000   36.000000
std     81394.10298   36.640142
min     10000.00000   10.000000
25%     15000.00000   15.000000
50%     20000.00000   25.000000
75%     30000.00000   30.000000
max    200000.00000  100.000000

In [31]:
df_cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   modelo    5 non-null      object
 1   marca     5 non-null      object
 2   valor     5 non-null      int64
 3   unidades  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes

In [32]:
df_cars.count()

modelo      5
marca       5
valor       5
unidades    5
dtype: int64

In [40]:
gp = df_cars.groupby('marca') # Quantity by marca
gp['marca'].count()

marca
Chevrolet    2
Fiat         2
VW           1
Name: marca, dtype: int64

In [41]:
gp['modelo'].value_counts() # Quantity of each model

marca      modelo
Chevrolet  Camaro    1
           Monza     1
Fiat       Palio     1
           Uno       1
VW         Gol       1
Name: modelo, dtype: int64

In [42]:
gp['valor'].mean() # Mean of each value per marca

marca
Chevrolet    110000.0
Fiat          12500.0
VW            30000.0
Name: valor, dtype: float64

In [43]:
gp['unidades'].sum() # Sum all unites per marca

marca
Chevrolet    130
Fiat          25
VW            25
Name: unidades, dtype: int64

In [45]:
df_cars['marca'].unique() # No repeat a element of array

array(['Fiat', 'Chevrolet', 'VW'], dtype=object)

**Merge DataFrames**

In [47]:
df1 = pd.DataFrame ({'A': [1,2,3], 'B': [7,5,2]}, index=[19,20,21])
df2 = pd.DataFrame ({'C': ['a', 'b', 'c'], 'D': ['d','e','f']}, index=[20,21,22])

In [50]:
df3 = pd.concat([df1,df2], axis=1) # Merge two DataFrames
df3

      A    B    C    D
19  1.0  7.0  NaN  NaN
20  2.0  5.0    a    d
21  3.0  2.0    b    e
22  NaN  NaN    c    f

In [51]:
df3.fillna(0) # Subs all NaN to 0

      A    B  C  D
19  1.0  7.0  0  0
20  2.0  5.0  a  d
21  3.0  2.0  b  e
22  0.0  0.0  c  f

**Filters DataFrames**

In [56]:
df3[df3['A']>2] # Select all values >2 in column A

      A    B  C  D
21  3.0  2.0  b  e

**Function apply**

In [57]:
df1

    A  B
19  1  7
20  2  5
21  3  2

In [58]:
df1.apply(lambda x:x*3) # Does this for all array elements

    A   B
19  3  21
20  6  15
21  9   6

In [60]:
def maioresdois(x):
    if x > 2:
        return True
    else:
        return False
df1['maiores_2'] = df1['A'].apply(maioresdois)
df1

    A  B  maiores_2
19  1  7      False
20  2  5      False
21  3  2       True

**Import and Export**

In [61]:
df = pd.read_csv('C:/Users/Marcelo Sampaio/Desktop/Datasets/ford.csv') # Import DataFrame
df.head()

     model  year  price transmission  mileage fuelType  tax   mpg  engineSize
0   Fiesta  2017  12000    Automatic    15944   Petrol  150  57.7         1.0
1    Focus  2018  14000       Manual     9083   Petrol  150  57.7         1.0
2    Focus  2017  13000       Manual    12456   Petrol  150  57.7         1.0
3   Fiesta  2019  17500       Manual    10460   Petrol  145  40.3         1.5
4   Fiesta  2019  16500    Automatic     1482   Petrol  145  48.7         1.0

In [62]:
df.head(15).to_html('ford.html') # Export DataFrame to html